tutorials/nineBlocks/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // B0 zMin surface
    (0 0 0)  // v00
    (1 0 0)  // v01
    (1 1 0)  // v02
    (0 1 0)  // v03

    // B1 zMin surface
    //(1 0 0)  // v01
    (2 0 0)  // v04
    (2 1 0)  // v05
    //(1 1 0)  // v02

    // B2 zMin surface
    //(2 0 0)  // v04
    (3 0 0)  // v06
    (3 1 0)  // v07
    //(2 1 0)  // v05

    // B3 zMin surface
    //(0 1 0)  // v03
    //(1 1 0)  // v02
    (1 2 0)  // v08
    (0 2 0)  // v09

    // B4 zMin surface
    //(1 1 0)  // v02
    //(2 1 0)  // v05
    (2 2 0)  // v10
    //(1 2 0)  // v08

    // B5 zMin surface
    //(2 1 0)  // v05
    //(3 1 0)  // v07
    (3 2 0)  // v11
    //(2 2 0)  // v10

    // B6 zMin surface
    //(0 2 0)  // v09
    //(1 2 0)  // v08
    (1 3 0)  // v12
    (0 3 0)  // v13

    // B7 zMin surface
    //(1 2 0)  // v08
    //(2 2 0)  // v10
    (2 3 0)  // v14
    //(1 3 0)  // v12

    // B8 zMin surface
    //(2 2 0)  // v10
    //(3 2 0)  // v11
    (3 3 0)  // v15
    //(2 3 0)  // v14


    // B0 zMax surface
    (0 0 3)  // v16
    (1 0 3)  // v17
    (1 1 3)  // v18
    (0 1 3)  // v19

    // B1 zMax surface
    //(1 0 3)  // v17
    (2 0 3)  // v20
    (2 1 3)  // v21
    //(1 1 3)  // v18

    // B2 zMax surface
    //(2 0 3)  // v20
    (3 0 3)  // v22
    (3 1 3)  // v23
    //(2 1 3)  // v21

    // B3 zMax surface
    //(0 1 3)  // v19
    //(1 1 3)  // v18
    (1 2 3)  // v24
    (0 2 3)  // v25

    // B4 zMax surface
    //(1 1 3)  // v18
    //(2 1 3)  // v21
    (2 2 3)  // v26
    //(1 2 3)  // v24

    // B5 zMax surface
    //(2 1 3)  // v21
    //(3 1 3)  // v23
    (3 2 3)  // v27
    //(2 2 3)  // v26

    // B6 zMax surface
    //(0 2 3)  // v25
    //(1 2 3)  // v24
    (1 3 3)  // v28
    (0 3 3)  // v29

    // B7 zMax surface
    //(1 2 3)  // v24
    //(2 2 3)  // v26
    (2 3 3)  // v30
    //(1 3 3)  // v28

    // B8 zMax surface
    //(2 2 3)  // v26
    //(3 2 3)  // v27
    (3 3 3)  // v31
    //(2 3 3)  // v30
);

blocks
(
    // zMax number = zMin + 16
    hex ( 0  1  2  3 16 17 18 19) (7 7 10) grading (1 1 1) // B0
    hex ( 1  4  5  2 17 20 21 18) (5 7 10) grading (1 1 1) // B1
    hex ( 4  6  7  5 20 22 23 21) (3 7 10) grading (1 1 1) // B2

    hex ( 3  2  8  9 19 18 24 25) (7 5 10) grading (1 1 1) // B3
    hex ( 2  5 10  8 18 21 26 24) (5 5 10) grading (1 1 1) // B4
    hex ( 5  7 11 10 21 23 27 26) (3 5 10) grading (1 1 1) // B5

    hex ( 9  8 12 13 25 24 28 29) (7 3 10) grading (1 1 1) // B6
    hex ( 8 10 14 12 24 26 30 28) (5 3 10) grading (1 1 1) // B7
    hex (10 11 15 14 26 27 31 30) (3 3 10) grading (1 1 1) // B8
);

edges ( );

boundary
(
    xMin
    {
        type patch;
        faces
        (
            ( 0 16 19  3)  // (0 0) B0
            ( 3 19 25  9)  // (3 0) B3
            ( 9 25 29 13)  // (6 0) B6
        );
    }
    xMax
    {
        type patch;
        faces
        (
            ( 6  7 23 22)  // (2 1) B2
            ( 7 11 27 23)  // (5 1) B5
            (11 15 31 27)  // (8 1) B8
        );
    }
    yMin
    {
        type patch;
        faces
        (
            ( 0  1 17 16)  // (0 2) B0
            ( 1  4 20 17)  // (1 2) B1
            ( 4  6 22 20)  // (2 2) B2
        );
    }
    yMax
    {
        type patch;
        faces
        (
            (13 29 28 12)  // (6 3) B6
            (12 28 30 14)  // (7 3) B7
            (14 30 31 15)  // (8 3) B8
        );
    }
    zMin
    {
        type patch;
        faces
        (
            ( 0  3  2  1)  // (0 4) B0
            ( 1  2  5  4)  // (1 4) B1
            ( 4  5  7  6)  // (2 4) B2
            ( 3  9  8  2)  // (3 4) B3
            ( 2  8 10  5)  // (4 4) B4
            ( 5 10 11  7)  // (5 4) B5
            ( 9 13 12  8)  // (6 4) B6
            ( 8 12 14 10)  // (7 4) B7
            (10 14 15 11)  // (8 4) B8
        );
    }
    zMax
    {
        type patch;
        faces
        (
            (16 17 18 19)  // (0 5) B0
            (17 20 21 18)  // (1 5) B1
            (20 22 23 21)  // (2 5) B2
            (19 18 24 25)  // (3 5) B3
            (18 21 26 24)  // (4 5) B4
            (21 23 27 26)  // (5 5) B5
            (25 24 28 29)  // (6 5) B6
            (24 26 30 28)  // (7 5) B7
            (26 27 31 30)  // (8 5) B8
        );
    }
);

// ************************************************************************* //
